html/10-lessons-learned-from-the-early-days-of-google.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>10 Lessons Learned from the Early Days of Google</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">10 Lessons Learned from the Early Days of Google</h1>
<p>
中文：<a href="http://www.techug.com/matt-cutts-10-lessons-learned-from-google">http://www.techug.com/matt-cutts-10-lessons-learned-from-google</a>
</p>

<p>
原文：<a href="http://highscalability.com/blog/2015/2/4/matt-cutts-10-lessons-learned-from-the-early-days-of-google.html">http://highscalability.com/blog/2015/2/4/matt-cutts-10-lessons-learned-from-the-early-days-of-google.html</a>
</p>

<p>
挺强烈推荐的。其中3，6，9，10对我最有启发。
</p>

<ul class="org-ul">
<li>3. Be proactive. No one cares about your career or your money than you do. Ask for what you want. You miss 100% of the shots you don’t take.  # 不要等别人告诉你应该做什么事情，那样自己会比较被动不太可能做自己想做的事情。主动去发现自己想做的事情，这样你（和你的经理）会发现自己会比以往更加投入。
</li>
</ul>
<blockquote>
<p>
Matt was “volunteered” to work on the front-end of the ads product, where he worked for about a year. During this experience Matt could see people starting to spam Google. So Matt went to a VP of Engineering and said “I want to work on spam” and the VP said OK. Just like that. Before that Matt largely went along with what others thought he should do.
</p>

<p>
You would be amazed what a difference it makes to just tell someone “I would like to do X.” If you are manager, if someone wants to work on something they will work twice as hard.
</p>
</blockquote>

<ul class="org-ul">
<li>6. Was commodity hardware why Google succeeded? # 不断地创新才能成功
</li>
</ul>
<blockquote>
<p>
No, success is hundreds of innovations. It’s not like there’s one shining epiphany and everything is set. So it wasn’t just cheap hardware, it wasn’t just Page Rank, it was Map Reduce, Spanner, and so on. It takes many innovations to make a successful company or a successful career.
</p>
</blockquote>

<ul class="org-ul">
<li>9. No matter what bad things are going to happen. Have some fun along the way and take some pictures. # 革命精神，"苦"中作乐。目标很重要，过程也很重要。从过程中寻找快乐并且记录下来，生活会更加有意义。
</li>
</ul>
<blockquote>
<p>
You could record every meeting if you wanted too. Digital is cheap. Ten years from now you’ll want to remember that ping pong table where eight of you would sit around and talk about making Google search quality better. You’re going to want to remember that huge dog. You’re going to want to remember the good old days.
</p>

<p>
Try to take pictures when something funny or quirky happens. One example was a giant cookie sent in by someone wanting reinclusion into search. Other examples are April fools pranks and Halloween traditions.
</p>

<p>
There was a bet Matt made with his team where they could do anything they wanted to his hair of they did a really good job fighting spam for a quarter. They cut it all off
</p>

<p>
Interesting story about weekly meetings where employees could grill the execs about why they made the decisions they made.
</p>
</blockquote>

<ul class="org-ul">
<li>10. Whatever you are working on, try to make sure it matters, it’s something you care about, and it’s something people want. # 做别人和自己都在乎的东西。
</li>
</ul>
<blockquote>
<p>
Matt has always thought of Google as a tool and they try to make it the best tool they can.
</p>

<p>
Fred Brooks in The "Computer Scientist as Toolsmith": If we perceive our role aright, we then see more clearly the proper criterion for success: a toolmaker succeeds as, and only as, the users of his tool succeed with his aid.
</p>
</blockquote>
</div>
</body>
</html>
